{
  "welcome": "Innovative IT Solutions for Your Business",
  "description": "We deliver cutting-edge technology consulting and digital transformation services to help your business thrive in the digital era",
  "getStarted": "Get a Free Consultation",
  "learnMore": "Explore Our Services",
  "services": "Our Services",
  "whyChooseUs": "Why Choose Vexita",
  "contactUs": "Contact Us",
  "about": "About Us",
  "home": "Home",
  "careers": "Careers",
  "contact": "Contact",
  "contactHero": "Don't hesitate to reach out!",
  "contactHeroDescription": "We would love to hear from you! Please fill out the form and you will hear from us shortly.",
  "contactInformation": "Contact Information",
  "officeAddress": "Office Address",
  "postAddress": "Postadress",
  "phone": "Phone",
  "email": "Email",
  "businessHours": "Business Hours",
  "businessHoursText": "Monday - Friday: 9:00 AM - 6:00 PM\nSaturday - Sunday: Closed",
  "findUs": "Find Us",
  "firstName": "First name",
  "lastName": "Last name",
  "emailLabel": "Email *",
  "howCanWeHelp": "How can we help? *",
  "sendMessage": "Send message",
  "sending": "Sending...",
  "servicesHero": "Our Services",
  "servicesHeroDescription": "Comprehensive technology solutions to drive your business forward",
  "digitalTransformation": "Digital Transformation",
  "digitalTransformationDescription": "We help businesses modernize their operations through strategic digital transformation initiatives. Our approach focuses on aligning technology with your business goals to create sustainable growth.",
  "digitalTransformationFeatures": [
    "Business process automation",
    "Legacy system modernization",
    "Digital workplace solutions",
    "Data-driven decision making"
  ],
  "cloudSolutions": "Cloud Solutions",
  "cloudSolutionsDescription": "Our cloud experts design, implement, and manage secure cloud environments that scale with your business. We work with leading cloud providers to deliver reliable and cost-effective solutions.",
  "cloudSolutionsFeatures": [
    "Cloud migration strategies",
    "Multi-cloud architecture",
    "Cloud security and compliance",
    "Managed cloud services"
  ],
  "softwareDevelopment": "Software Development",
  "softwareDevelopmentDescription": "We build custom software solutions that address your unique business challenges. Our development team follows industry best practices to deliver high-quality, maintainable code.",
  "softwareDevelopmentFeatures": [
    "Custom application development",
    "Web and mobile applications",
    "API development and integration",
    "DevOps and CI/CD implementation"
  ],
  "itSecurity": "IT Security",
  "itSecurityDescription": "Protect your business with our comprehensive cybersecurity solutions. We help identify vulnerabilities, implement security controls, and develop incident response plans.",
  "itSecurityFeatures": [
    "Security assessments and audits",
    "Endpoint protection",
    "Network security",
    "Security awareness training"
  ],
  "readyToGetStarted": "Ready to get started?",
  "readyToGetStartedDescription": "Contact us today for a free consultation and discover how our IT consulting services can help your business grow.",
  "expertTeam": "Expert Team",
  "expertTeamDescription": "Our team of certified IT professionals brings decades of industry experience.",
  "provenResults": "Proven Results",
  "provenResultsDescription": "We've helped hundreds of businesses achieve their technology goals.",
  "dedicatedSupport": "Dedicated Support",
  "dedicatedSupportDescription": "24/7 support and maintenance to keep your systems running smoothly.",
  "joinOurTeam": "Join Our Team",
  "joinOurTeamDescription": "We are looking for Developers/Engineers with a passion for both technology and design to join our growing team at Vexita AB. With us, you'll work on assignments with exciting clients in both private and public sectors, where you'll contribute to building user-friendly and modern digital solutions. As an employed consultant, we match you with assignments that fit your skills, experience, and career goals.",
  "currentOpenings": "Current Openings",
  "applyNow": "Apply Now",
  "requirements": "Requirements:",
  "goodToHave": "Good to Have:",
  "whyWorkWithUs": "Why Work With Us?",
  "innovationFocus": "Innovation Focus",
  "innovationFocusDescription": "Work with cutting-edge technologies and innovative solutions that make a real impact.",
  "greatTeam": "Great Team",
  "greatTeamDescription": "Join a collaborative team of talented professionals who support each other's growth.",
  "growthOpportunities": "Growth Opportunities",
  "growthOpportunitiesDescription": "Continuous learning and development opportunities to advance your career.",
  "dontSeeRightPosition": "Don't see the right position?",
  "dontSeeRightPositionDescription": "We're always looking for talented individuals. Send us your CV and we'll keep you in mind for future opportunities.",
  "backToCareers": "Back to Careers",
  "aboutTheRole": "ABOUT THE ROLE",
  "candidatesShould": "Candidates should",
  "languageRequirements": "Language requirements",
  "aboutHero": "About Vexita AB",
  "aboutHeroDescription": "Your trusted partner for innovative technology solutions",
  "ourStory": "Our Story",
  "ourStoryParagraph1": "Founded in 2015, Vexita AB began with a simple mission: to help businesses leverage technology to achieve their goals. What started as a small team of passionate IT professionals has grown into a full-service consulting firm with expertise across the technology spectrum.",
  "ourStoryParagraph2": "Over the years, we've helped businesses across various industries transform their technology infrastructure, implement innovative solutions, and stay ahead in an increasingly digital world.",
  "ourStoryParagraph3": "Today, we continue to be driven by our founding principles: delivering exceptional value, maintaining technical excellence, and building lasting client relationships based on trust and results.",
  "founded": "Founded",
  "projects": "Projects",
  "years": "Years",
  "ourValues": "Our Values",
  "ourValuesDescription": "The principles that drive everything we do and define who we are as your technology partner.",
  "integrityFirst": "Integrity First",
  "integrityFirstDescription": "Honest advice. Transparent pricing. No hidden agendas. We recommend what's right for you, not what's profitable for us.",
  "integrityFirstExpanded": "Trust is the foundation of every successful technology partnership. We earn it through consistent honesty, clear communication, and always putting your business interests first. When we say something will work, it will. When we identify risks, we'll tell you upfront. No surprises, no excuses—just reliable expertise you can count on.",
  "futureReadyInnovation": "Future-Ready Innovation",
  "futureReadyInnovationDescription": "We don't just follow trends—we anticipate them. Cutting-edge solutions that keep you ahead of tomorrow's challenges.",
  "futureReadyInnovationExpanded": "Innovation isn't about using the latest technology for its own sake. It's about identifying emerging opportunities and building solutions that give you a competitive advantage. Our team continuously researches new technologies, evaluates their business potential, and implements only those that deliver real value to your organization.",
  "relentlessExcellence": "Relentless Excellence",
  "relentlessExcellenceDescription": "Good enough isn't good enough. We obsess over details and deliver solutions that exceed expectations every time.",
  "relentlessExcellenceExpanded": "Excellence is a habit, not an accident. Every line of code, every system design, every client interaction reflects our commitment to the highest standards. We implement rigorous quality assurance processes, conduct thorough testing, and continuously refine our methodologies to ensure exceptional results that stand the test of time.",
  "truePartnership": "True Partnership",
  "truePartnershipDescription": "We're not just vendors—we're your technology allies. Your wins are our wins. Your growth is our mission.",
  "truePartnershipExpanded": "Real partnerships go beyond contracts and deliverables. We invest time in understanding your business goals, industry challenges, and growth aspirations. Our success is measured by your success, which means we're motivated to find solutions that drive long-term value, not just quick fixes. We become an extension of your team, sharing knowledge and celebrating achievements together.",
  "lightningAgility": "Lightning Agility",
  "lightningAgilityDescription": "Markets move fast. We move faster. Rapid deployment, quick pivots, and solutions that adapt as your business evolves.",
  "lightningAgilityExpanded": "In today's business environment, speed is a competitive advantage. Our agile methodologies and flexible team structure allow us to respond quickly to changing requirements, market conditions, and new opportunities. We build scalable solutions that can evolve with your business, ensuring your technology infrastructure supports growth rather than limiting it.",
  "measurableImpact": "Measurable Impact",
  "measurableImpactDescription": "Technology for technology's sake is pointless. Every solution we deliver drives real, measurable business results.",
  "measurableImpactExpanded": "We believe in accountability and results. Before starting any project, we establish clear success metrics and key performance indicators. Our solutions are designed to deliver tangible benefits—whether that's increased efficiency, cost savings, revenue growth, or improved customer satisfaction. We track progress and provide regular reports to ensure you see the value of your technology investment.",
  "readyToWorkWithUs": "Ready to work with us?",
  "readyToWorkWithUsDescription": "Let's discuss how our team can help your business achieve its technology goals.",
  "company": "Company",
  "aboutUs": "About Us",
  "ourServices": "Our Services",
  "allRightsReserved": "All rights reserved",
  "jobOpenings": {
    "backendDeveloper": {
      "title": "Backend Developer",
      "shortDescription": "Mid-Senior Level Backend Development",
      "aboutRole": "We are looking for an experienced Backend Developer with 4-6+ years of experience. We welcome developers with expertise in various backend technologies including Java, .NET/C#, Go, Python, Node.js, or similar. If you have a solid technical background, passion for building scalable backend systems, and are curious about modern technologies, we have an exciting opportunity for you.",
      "requirements": [
        "4-6+ years of backend development experience in one or more languages (Java, .NET/C#, Go, Python, Node.js, or similar)",
        "Strong understanding of RESTful APIs and API design principles",
        "Experience with microservices architecture and distributed systems",
        "Proficiency in relational databases (PostgreSQL, MySQL, SQL Server, Oracle) and/or NoSQL databases (MongoDB, Cassandra, DynamoDB)",
        "Experience with cloud platforms (AWS, Azure, or GCP)",
        "Knowledge of containerization and orchestration (Docker, Kubernetes)",
        "Understanding of CI/CD pipelines and DevOps practices",
        "Experience with version control (Git) and collaborative development workflows",
        "Strong knowledge of software design patterns and SOLID principles",
        "Experience with testing frameworks and TDD/BDD practices",
        "Understanding of message queues and event-driven architecture (RabbitMQ, Kafka, SQS, etc.)",
        "Knowledge of authentication and authorization mechanisms (OAuth2, JWT, etc.)"
      ],
      "goodToHave": [
        "Experience with GraphQL",
        "Knowledge of serverless architectures (AWS Lambda, Azure Functions, Google Cloud Functions)",
        "Experience with gRPC and protocol buffers",
        "Familiarity with monitoring and observability tools (Prometheus, Grafana, ELK Stack, Datadog)",
        "Experience with Infrastructure as Code (Terraform, CloudFormation, Pulumi)",
        "Knowledge of caching strategies (Redis, Memcached)",
        "Experience with search engines (Elasticsearch, Solr)",
        "Understanding of security best practices and secure coding",
        "Experience with Agile/Scrum methodologies",
        "Contributions to open-source projects"
      ],
      "candidatesShould": [
        "Be highly professional and solution-oriented with a focus on client business needs",
        "Be highly responsible and reliable",
        "Have excellent communication and collaboration skills",
        "Be flexible and adaptable to different technologies and project requirements",
        "Have a passion for continuous learning and staying updated with industry trends"
      ],
      "languageRequirements": [
        "English (Fluent)"
      ]
    },
    "frontendDeveloper": {
      "title": "Frontend Developer",
      "shortDescription": "Mid-Senior Level Frontend Development",
      "aboutRole": "We are seeking an experienced Frontend Developer with 4-6+ years of experience in building modern, responsive web applications. If you have a passion for creating exceptional user experiences, working with cutting-edge frontend technologies, and collaborating with cross-functional teams, this is the perfect opportunity for you.",
      "requirements": [
        "4-6+ years of frontend development experience",
        "Strong proficiency in modern JavaScript (ES6+) and TypeScript",
        "Expert knowledge of React, Vue.js, or Angular frameworks",
        "Experience with state management libraries (Redux, Zustand, Vuex, Pinia, NgRx)",
        "Proficiency in HTML5, CSS3, and modern CSS frameworks (Tailwind CSS, Styled Components, CSS Modules)",
        "Experience with responsive design and mobile-first development",
        "Knowledge of build tools and bundlers (Webpack, Vite, Parcel, Rollup)",
        "Experience with testing frameworks (Jest, Vitest, React Testing Library, Cypress, Playwright)",
        "Understanding of RESTful APIs and GraphQL",
        "Experience with version control (Git) and collaborative workflows",
        "Knowledge of performance optimization techniques and tools (Lighthouse, Web Vitals)",
        "Understanding of accessibility standards (WCAG) and best practices"
      ],
      "goodToHave": [
        "Experience with Next.js, Nuxt.js, or Remix",
        "Knowledge of Progressive Web Apps (PWA)",
        "Experience with animation libraries (Framer Motion, GSAP, Lottie)",
        "Familiarity with design systems and component libraries (Storybook)",
        "Experience with micro-frontends architecture",
        "Knowledge of WebAssembly",
        "Experience with server-side rendering (SSR) and static site generation (SSG)",
        "Understanding of SEO best practices",
        "Experience with CI/CD pipelines for frontend applications",
        "Knowledge of Web3 and blockchain technologies"
      ],
      "candidatesShould": [
        "Be highly creative and user-focused",
        "Have excellent attention to detail and design sensibility",
        "Be collaborative and able to work effectively with designers and backend developers",
        "Have strong problem-solving skills",
        "Be adaptable and eager to learn new technologies"
      ],
      "languageRequirements": [
        "English (Fluent)"
      ]
    },
    "fullstackDeveloper": {
      "title": "Fullstack Developer",
      "shortDescription": "Mid-Senior Level Fullstack Development",
      "aboutRole": "We are looking for an experienced Fullstack Developer with 4-6+ years of experience who can work across the entire technology stack. If you enjoy building end-to-end solutions, working with both frontend and backend technologies, and have a passion for creating seamless user experiences, we have an exciting opportunity for you.",
      "requirements": [
        "4-6+ years of fullstack development experience",
        "Strong proficiency in frontend technologies (React, Vue.js, or Angular) and modern JavaScript/TypeScript",
        "Solid backend development skills in one or more languages (Node.js, Python, Java, .NET/C#, Go)",
        "Experience with RESTful APIs and GraphQL",
        "Proficiency in database design and management (PostgreSQL, MySQL, MongoDB, or similar)",
        "Experience with cloud platforms (AWS, Azure, or GCP)",
        "Knowledge of containerization (Docker) and basic orchestration concepts",
        "Understanding of CI/CD pipelines and DevOps practices",
        "Experience with version control (Git) and collaborative development",
        "Strong knowledge of software architecture patterns (MVC, MVP, MVVM, Clean Architecture)",
        "Experience with testing at both frontend and backend levels",
        "Understanding of authentication and authorization mechanisms"
      ],
      "goodToHave": [
        "Experience with fullstack frameworks (Next.js, Nuxt.js, Remix, NestJS)",
        "Knowledge of microservices and serverless architectures",
        "Experience with message queues and event-driven systems",
        "Familiarity with Infrastructure as Code (Terraform, CloudFormation)",
        "Experience with monitoring and logging tools",
        "Knowledge of caching strategies (Redis, Memcached)",
        "Understanding of security best practices across the stack",
        "Experience with Agile/Scrum methodologies",
        "Knowledge of WebSockets and real-time communication",
        "Experience with search engines (Elasticsearch)"
      ],
      "candidatesShould": [
        "Be versatile and able to work across different technology stacks",
        "Have excellent communication skills to collaborate with both frontend and backend teams",
        "Be solution-oriented with a holistic understanding of software development",
        "Have strong problem-solving and debugging skills",
        "Be adaptable and willing to learn new technologies"
      ],
      "languageRequirements": [
        "English (Fluent)"
      ]
    },
    "qaTestLead": {
      "title": "QA & Test Lead",
      "shortDescription": "Mid-Senior Level Quality Assurance and Testing",
      "aboutRole": "We are seeking an experienced QA & Test Lead with 4-6+ years of experience in quality assurance and test automation. If you have a passion for ensuring software quality, leading testing initiatives, and implementing modern testing strategies, this is an excellent opportunity to join our team.",
      "requirements": [
        "4-6+ years of experience in QA and software testing",
        "Strong knowledge of test automation frameworks (Selenium, Cypress, Playwright, TestCafe, or similar)",
        "Experience with API testing tools (Postman, REST Assured, Karate, or similar)",
        "Proficiency in at least one programming language (Java, Python, JavaScript/TypeScript, C#)",
        "Experience with performance testing tools (JMeter, Gatling, K6, or similar)",
        "Knowledge of test management tools (TestRail, Zephyr, qTest, or similar)",
        "Understanding of CI/CD integration for automated testing",
        "Experience with version control (Git) and collaborative workflows",
        "Strong knowledge of testing methodologies (Agile, BDD, TDD)",
        "Experience with database testing and SQL",
        "Understanding of mobile testing (iOS and Android)",
        "Knowledge of accessibility testing and WCAG standards"
      ],
      "goodToHave": [
        "Experience with visual regression testing (Percy, Applitools, Chromatic)",
        "Knowledge of security testing and OWASP Top 10",
        "Experience with contract testing (Pact, Spring Cloud Contract)",
        "Familiarity with chaos engineering and resilience testing",
        "Experience with test data management and synthetic data generation",
        "Knowledge of AI/ML-based testing tools",
        "Experience with cloud-based testing platforms (Sauce Labs, BrowserStack, AWS Device Farm)",
        "Understanding of observability and monitoring tools for test analysis",
        "Experience leading QA teams or mentoring junior testers",
        "ISTQB or similar certifications"
      ],
      "candidatesShould": [
        "Be detail-oriented with a strong focus on quality",
        "Have excellent analytical and problem-solving skills",
        "Be able to lead testing initiatives and collaborate with development teams",
        "Have strong communication skills to report issues and test results effectively",
        "Be proactive in identifying potential quality issues early in the development cycle"
      ],
      "languageRequirements": [
        "English (Fluent)"
      ]
    },
    "devopsCloud": {
      "title": "DevOps Engineer",
      "shortDescription": "Mid-Senior Level Infrastructure Engineering and Automation",
      "aboutRole": "We are looking for an experienced DevOps Engineer with 4-6+ years of experience in designing, building, and automating cloud infrastructure. This role focuses on infrastructure engineering, CI/CD pipeline development, and creating scalable, reliable systems. If you have a passion for building infrastructure from the ground up, automating workflows, and working closely with development teams, we have an exciting opportunity for you.",
      "requirements": [
        "4-6+ years of experience in DevOps, infrastructure engineering, or cloud platform engineering",
        "Strong expertise in at least one major cloud platform (AWS, Azure, or GCP) with deep understanding of cloud services",
        "Proficiency in Infrastructure as Code (Terraform, CloudFormation, Pulumi, or Ansible) - this is essential",
        "Experience designing and building containerization and orchestration solutions (Docker, Kubernetes, ECS, EKS, AKS, GKE)",
        "Deep knowledge of designing and implementing CI/CD pipelines (Jenkins, GitLab CI, GitHub Actions, Azure DevOps, CircleCI, or similar)",
        "Experience with configuration management tools (Ansible, Puppet, Chef)",
        "Strong scripting and automation skills (Bash, Python, PowerShell, or similar)",
        "Knowledge of monitoring and observability architecture (Prometheus, Grafana, ELK Stack, Datadog, New Relic, CloudWatch)",
        "Understanding of cloud networking, security architecture, and compliance frameworks",
        "Experience with version control (Git) and GitOps practices",
        "Knowledge of service mesh technologies (Istio, Linkerd, Consul)",
        "Experience with infrastructure design patterns and best practices"
      ],
      "goodToHave": [
        "Cloud certifications (AWS Certified Solutions Architect, Azure Solutions Architect, GCP Professional Cloud Architect)",
        "Experience with serverless architectures (Lambda, Azure Functions, Cloud Functions)",
        "Knowledge of multi-cloud and hybrid cloud strategies",
        "Experience with infrastructure monitoring and alerting (PagerDuty, Opsgenie)",
        "Familiarity with secrets management (HashiCorp Vault, AWS Secrets Manager, Azure Key Vault)",
        "Experience with cost optimization and cloud financial management",
        "Knowledge of chaos engineering and reliability practices",
        "Experience with platform engineering and developer experience optimization",
        "Understanding of security scanning and vulnerability management tools",
        "Experience with infrastructure automation and self-service platforms"
      ],
      "candidatesShould": [
        "Be highly technical with a strong engineering mindset",
        "Have excellent communication skills to collaborate with development teams on infrastructure design",
        "Be proactive in designing scalable and maintainable infrastructure solutions",
        "Have a passion for automation, infrastructure as code, and continuous improvement",
        "Be able to work on strategic infrastructure projects and handle on-call responsibilities when needed"
      ],
      "languageRequirements": [
        "English (Fluent)"
      ]
    },
    "itSecurity": {
      "title": "IT Security Specialist",
      "shortDescription": "Mid-Senior Level IT Security and Cybersecurity",
      "aboutRole": "We are seeking an experienced IT Security Specialist with 4-6+ years of experience in cybersecurity, security architecture, and risk management. If you have a passion for protecting systems and data, implementing security best practices, and staying ahead of emerging threats, this is an excellent opportunity.",
      "requirements": [
        "4-6+ years of experience in IT security, cybersecurity, or information security",
        "Strong knowledge of security frameworks and standards (ISO 27001, NIST, OWASP, CIS Controls)",
        "Experience with security assessment and penetration testing tools (Burp Suite, OWASP ZAP, Metasploit, Nmap)",
        "Understanding of cloud security (AWS Security, Azure Security, GCP Security)",
        "Knowledge of network security, firewalls, and intrusion detection/prevention systems",
        "Experience with identity and access management (IAM, SSO, MFA, OAuth2, SAML)",
        "Understanding of encryption, cryptography, and secure communication protocols (TLS/SSL, VPN)",
        "Experience with security monitoring and SIEM tools (Splunk, ELK Security, Azure Sentinel, AWS Security Hub)",
        "Knowledge of vulnerability management and security scanning tools",
        "Understanding of secure coding practices and application security",
        "Experience with compliance and regulatory requirements (GDPR, SOC 2, PCI-DSS)",
        "Strong knowledge of incident response and security operations"
      ],
      "goodToHave": [
        "Security certifications (CISSP, CISM, CEH, GSEC, Security+, or similar)",
        "Experience with DevSecOps and security automation",
        "Knowledge of threat modeling and risk assessment methodologies",
        "Experience with security orchestration and automated response (SOAR)",
        "Familiarity with zero-trust architecture principles",
        "Experience with container security and Kubernetes security",
        "Knowledge of API security and API gateway security",
        "Understanding of security in microservices and serverless architectures",
        "Experience with security awareness training and education",
        "Knowledge of blockchain security and Web3 security"
      ],
      "candidatesShould": [
        "Be highly analytical with strong attention to detail",
        "Have excellent problem-solving and critical thinking skills",
        "Be able to communicate security risks and recommendations effectively to technical and non-technical stakeholders",
        "Stay updated with the latest security threats and trends",
        "Be proactive in identifying and mitigating security risks"
      ],
      "languageRequirements": [
        "English (Fluent)"
      ]
    },
    "devopsSupport": {
      "title": "Operations & Support Engineer",
      "shortDescription": "Mid-Senior Level Operations, Maintenance, and Technical Support",
      "aboutRole": "We are looking for an experienced Operations & Support Engineer (Drift & Support) with 4-6+ years of experience in day-to-day operations, system maintenance, and customer-facing technical support. This role focuses on keeping systems running smoothly, responding to incidents, and providing excellent support to customers and internal teams. If you have a passion for operational excellence, troubleshooting, and ensuring system reliability, we have an exciting opportunity for you.",
      "requirements": [
        "4-6+ years of experience in operations, system administration, or technical support",
        "Strong knowledge of Linux/Unix systems administration and troubleshooting",
        "Experience with cloud platforms (AWS, Azure, or GCP) from an operational perspective",
        "Proficiency in monitoring, alerting, and incident response (Prometheus, Grafana, Nagios, Datadog, New Relic, CloudWatch)",
        "Experience with incident management and ticketing systems (Jira, ServiceNow, Zendesk, or similar) - this is essential",
        "Strong scripting skills for automation and troubleshooting (Bash, Python, PowerShell, or similar)",
        "Knowledge of containerization and orchestration for operational support (Docker, Kubernetes)",
        "Understanding of CI/CD pipelines and deployment processes from an operational standpoint",
        "Experience with log aggregation, analysis, and troubleshooting (ELK Stack, Splunk, CloudWatch Logs, or similar)",
        "Knowledge of database administration, troubleshooting, and maintenance (PostgreSQL, MySQL, MongoDB, or similar)",
        "Experience with version control (Git) and configuration management",
        "Understanding of networking, DNS, load balancing, and CDN concepts for operational support"
      ],
      "goodToHave": [
        "Experience with Infrastructure as Code (Terraform, CloudFormation, Ansible) for operational tasks",
        "Knowledge of service mesh technologies (Istio, Linkerd) for troubleshooting",
        "Experience with on-call rotations and incident response procedures - this is important",
        "Familiarity with ITIL or similar IT service management frameworks",
        "Experience with customer-facing support and communication - this is essential",
        "Knowledge of backup, disaster recovery procedures, and business continuity",
        "Experience with performance tuning, optimization, and capacity planning",
        "Understanding of security best practices in operations",
        "Experience with automated remediation and self-healing systems",
        "Knowledge of cost optimization and resource management in cloud environments"
      ],
      "candidatesShould": [
        "Be highly customer-focused with excellent communication and interpersonal skills",
        "Have strong problem-solving abilities and attention to detail",
        "Be able to work under pressure, handle multiple priorities, and manage time effectively",
        "Have a proactive approach to identifying, preventing, and resolving operational issues",
        "Be available for on-call responsibilities and flexible working hours when needed - this is essential"
      ],
      "languageRequirements": [
        "English (Fluent)"
      ]
    },
    "dataAnalysis": {
      "title": "Data Analysis Engineer",
      "shortDescription": "Mid-Senior Level Data Engineering and Analytics",
      "aboutRole": "We are looking for an experienced Data & Analysis Engineer with 4-6+ years of experience in data engineering, analytics, and business intelligence. If you have a passion for building scalable data solutions, extracting insights from complex datasets, and working with modern data technologies, we have an exciting opportunity for you.",
      "requirements": [
        "4-6+ years of experience in data engineering, data analysis, or business intelligence",
        "Strong proficiency in SQL and data modeling",
        "Experience with at least one programming language (Python, Scala, Java, or R)",
        "Knowledge of data pipeline tools (Apache Airflow, Luigi, Prefect, or similar)",
        "Experience with big data technologies (Apache Spark, Hadoop, Kafka, Flink)",
        "Understanding of data warehousing concepts and architectures (star schema, snowflake schema)",
        "Experience with cloud data platforms (AWS, Azure, or GCP) and their data services",
        "Knowledge of ETL/ELT processes and data integration patterns",
        "Experience with version control (Git) and collaborative development",
        "Understanding of data quality, data governance, and data lineage",
        "Experience with business intelligence tools (Tableau, Power BI, Looker, or similar)",
        "Knowledge of statistical analysis and data visualization"
      ],
      "goodToHave": [
        "Experience with real-time data processing and streaming analytics",
        "Knowledge of machine learning and data science concepts",
        "Experience with data lake architectures (Delta Lake, Iceberg, Hudi)",
        "Familiarity with MLOps and model deployment pipelines",
        "Experience with NoSQL databases (MongoDB, Cassandra, DynamoDB)",
        "Knowledge of graph databases and graph analytics",
        "Experience with data cataloging and metadata management tools",
        "Understanding of data privacy regulations (GDPR, CCPA)",
        "Experience with cloud data warehouses (Snowflake, Redshift, BigQuery, Databricks)",
        "Knowledge of data mesh and data fabric architectures"
      ],
      "candidatesShould": [
        "Be highly analytical with strong problem-solving skills",
        "Have excellent attention to detail and data quality mindset",
        "Be able to translate business requirements into data solutions",
        "Have strong communication skills to present insights to stakeholders",
        "Be curious and proactive in exploring data to find patterns and insights"
      ],
      "languageRequirements": [
        "English (Fluent)"
      ]
    },
    "architecture": {
      "title": "Solution Architect",
      "shortDescription": "Mid-Senior Level Solution and System Architecture",
      "aboutRole": "We are seeking an experienced Solution Architect with 4-6+ years of experience in designing and implementing scalable, reliable software architectures. If you have a passion for creating technical solutions, working with modern architectural patterns, and guiding development teams, this is an excellent opportunity.",
      "requirements": [
        "4-6+ years of experience in software architecture, solution design, or technical leadership",
        "Strong knowledge of software architecture patterns (microservices, serverless, event-driven, monolithic to microservices migration)",
        "Experience with cloud architecture and cloud-native design (AWS, Azure, or GCP)",
        "Understanding of distributed systems, scalability, and high availability",
        "Knowledge of API design and integration patterns (REST, GraphQL, gRPC)",
        "Experience with containerization and orchestration (Docker, Kubernetes)",
        "Strong understanding of security architecture and best practices",
        "Experience with Infrastructure as Code (Terraform, CloudFormation, Pulumi)",
        "Knowledge of database design and data architecture (SQL, NoSQL, data modeling)",
        "Understanding of CI/CD pipelines and DevOps practices",
        "Experience with system design and technical documentation",
        "Strong communication skills to work with stakeholders and development teams"
      ],
      "goodToHave": [
        "Architecture certifications (AWS Solutions Architect, Azure Solutions Architect, TOGAF, or similar)",
        "Experience with enterprise architecture frameworks (TOGAF, Zachman)",
        "Knowledge of domain-driven design (DDD) and bounded contexts",
        "Experience with service mesh and API gateway architectures",
        "Understanding of event-driven architecture and CQRS patterns",
        "Experience with performance optimization and system tuning",
        "Knowledge of multi-cloud and hybrid cloud architectures",
        "Experience with legacy system modernization and migration strategies",
        "Understanding of observability and monitoring architectures",
        "Experience leading technical teams or architecture reviews"
      ],
      "candidatesShould": [
        "Be highly strategic with a big-picture mindset",
        "Have excellent analytical and problem-solving skills",
        "Be able to balance technical requirements with business needs",
        "Have strong leadership and mentoring capabilities",
        "Stay updated with emerging technologies and architectural trends"
      ],
      "languageRequirements": [
        "English (Fluent)"
      ]
    }
  }
}
