{
  "welcome": "Innovative IT Solutions for Your Business",
  "description": "We deliver cutting-edge technology consulting and digital transformation services to help your business thrive in the digital era",
  "getStarted": "Get a Free Consultation",
  "learnMore": "Explore Our Services",
  "services": "Our Services",
  "whyChooseUs": "Why Choose Vexita",
  "contactUs": "Contact Us",
  "about": "About Us",
  "home": "Home",
  "careers": "Careers",
  "contact": "Contact",
  "contactHero": "Don't hesitate to reach out!",
  "contactHeroDescription": "We would love to hear from you! Please fill out the form and you will hear from us shortly.",
  "contactInformation": "Contact Information",
  "officeAddress": "Office Address",
  "postAddress": "Postadress",
  "phone": "Phone",
  "email": "Email",
  "businessHours": "Business Hours",
  "businessHoursText": "Monday - Friday: 9:00 AM - 6:00 PM\nSaturday - Sunday: Closed",
  "findUs": "Find Us",
  "firstName": "First name",
  "lastName": "Last name",
  "emailLabel": "Email *",
  "howCanWeHelp": "How can we help? *",
  "sendMessage": "Send message",
  "sending": "Sending...",
  "servicesHero": "Our Services",
  "servicesHeroDescription": "Comprehensive technology solutions to drive your business forward",
  "digitalTransformation": "Digital Transformation",
  "digitalTransformationDescription": "We help businesses modernize their operations through strategic digital transformation initiatives. Our approach focuses on aligning technology with your business goals to create sustainable growth.",
  "digitalTransformationFeatures": [
    "Business process automation",
    "Legacy system modernization",
    "Digital workplace solutions",
    "Data-driven decision making"
  ],
  "cloudSolutions": "Cloud Solutions",
  "cloudSolutionsDescription": "Our cloud experts design, implement, and manage secure cloud environments that scale with your business. We work with leading cloud providers to deliver reliable and cost-effective solutions.",
  "cloudSolutionsFeatures": [
    "Cloud migration strategies",
    "Multi-cloud architecture",
    "Cloud security and compliance",
    "Managed cloud services"
  ],
  "softwareDevelopment": "Software Development",
  "softwareDevelopmentDescription": "We build custom software solutions that address your unique business challenges. Our development team follows industry best practices to deliver high-quality, maintainable code.",
  "softwareDevelopmentFeatures": [
    "Custom application development",
    "Web and mobile applications",
    "API development and integration",
    "DevOps and CI/CD implementation"
  ],
  "itSecurity": "IT Security",
  "itSecurityDescription": "Protect your business with our comprehensive cybersecurity solutions. We help identify vulnerabilities, implement security controls, and develop incident response plans.",
  "itSecurityFeatures": [
    "Security assessments and audits",
    "Endpoint protection",
    "Network security",
    "Security awareness training"
  ],
  "readyToGetStarted": "Ready to get started?",
  "readyToGetStartedDescription": "Contact us today for a free consultation and discover how our IT consulting services can help your business grow.",
  "expertTeam": "Expert Team",
  "expertTeamDescription": "Our team of certified IT professionals brings decades of industry experience.",
  "provenResults": "Proven Results",
  "provenResultsDescription": "We've helped hundreds of businesses achieve their technology goals.",
  "dedicatedSupport": "Dedicated Support",
  "dedicatedSupportDescription": "24/7 support and maintenance to keep your systems running smoothly.",
  "joinOurTeam": "Join Our Team",
  "joinOurTeamDescription": "Build your career with us and help shape the future of technology consulting",
  "currentOpenings": "Current Openings",
  "applyNow": "Apply Now",
  "requirements": "Requirements:",
  "whyWorkWithUs": "Why Work With Us?",
  "innovationFocus": "Innovation Focus",
  "innovationFocusDescription": "Work with cutting-edge technologies and innovative solutions that make a real impact.",
  "greatTeam": "Great Team",
  "greatTeamDescription": "Join a collaborative team of talented professionals who support each other's growth.",
  "growthOpportunities": "Growth Opportunities",
  "growthOpportunitiesDescription": "Continuous learning and development opportunities to advance your career.",
  "dontSeeRightPosition": "Don't see the right position?",
  "dontSeeRightPositionDescription": "We're always looking for talented individuals. Send us your CV and we'll keep you in mind for future opportunities.",
  "backToCareers": "Back to Careers",
  "aboutTheRole": "ABOUT THE ROLE",
  "candidatesShould": "Candidates should",
  "languageRequirements": "Language requirements",
  "aboutHero": "About Vexita AB",
  "aboutHeroDescription": "Your trusted partner for innovative technology solutions",
  "ourStory": "Our Story",
  "ourStoryParagraph1": "Founded in 2015, Vexita AB began with a simple mission: to help businesses leverage technology to achieve their goals. What started as a small team of passionate IT professionals has grown into a full-service consulting firm with expertise across the technology spectrum.",
  "ourStoryParagraph2": "Over the years, we've helped businesses across various industries transform their technology infrastructure, implement innovative solutions, and stay ahead in an increasingly digital world.",
  "ourStoryParagraph3": "Today, we continue to be driven by our founding principles: delivering exceptional value, maintaining technical excellence, and building lasting client relationships based on trust and results.",
  "founded": "Founded",
  "projects": "Projects",
  "years": "Years",
  "ourValues": "Our Values",
  "ourValuesDescription": "The principles that drive everything we do and define who we are as your technology partner.",
  "integrityFirst": "Integrity First",
  "integrityFirstDescription": "Honest advice. Transparent pricing. No hidden agendas. We recommend what's right for you, not what's profitable for us.",
  "integrityFirstExpanded": "Trust is the foundation of every successful technology partnership. We earn it through consistent honesty, clear communication, and always putting your business interests first. When we say something will work, it will. When we identify risks, we'll tell you upfront. No surprises, no excuses—just reliable expertise you can count on.",
  "futureReadyInnovation": "Future-Ready Innovation",
  "futureReadyInnovationDescription": "We don't just follow trends—we anticipate them. Cutting-edge solutions that keep you ahead of tomorrow's challenges.",
  "futureReadyInnovationExpanded": "Innovation isn't about using the latest technology for its own sake. It's about identifying emerging opportunities and building solutions that give you a competitive advantage. Our team continuously researches new technologies, evaluates their business potential, and implements only those that deliver real value to your organization.",
  "relentlessExcellence": "Relentless Excellence",
  "relentlessExcellenceDescription": "Good enough isn't good enough. We obsess over details and deliver solutions that exceed expectations every time.",
  "relentlessExcellenceExpanded": "Excellence is a habit, not an accident. Every line of code, every system design, every client interaction reflects our commitment to the highest standards. We implement rigorous quality assurance processes, conduct thorough testing, and continuously refine our methodologies to ensure exceptional results that stand the test of time.",
  "truePartnership": "True Partnership",
  "truePartnershipDescription": "We're not just vendors—we're your technology allies. Your wins are our wins. Your growth is our mission.",
  "truePartnershipExpanded": "Real partnerships go beyond contracts and deliverables. We invest time in understanding your business goals, industry challenges, and growth aspirations. Our success is measured by your success, which means we're motivated to find solutions that drive long-term value, not just quick fixes. We become an extension of your team, sharing knowledge and celebrating achievements together.",
  "lightningAgility": "Lightning Agility",
  "lightningAgilityDescription": "Markets move fast. We move faster. Rapid deployment, quick pivots, and solutions that adapt as your business evolves.",
  "lightningAgilityExpanded": "In today's business environment, speed is a competitive advantage. Our agile methodologies and flexible team structure allow us to respond quickly to changing requirements, market conditions, and new opportunities. We build scalable solutions that can evolve with your business, ensuring your technology infrastructure supports growth rather than limiting it.",
  "measurableImpact": "Measurable Impact",
  "measurableImpactDescription": "Technology for technology's sake is pointless. Every solution we deliver drives real, measurable business results.",
  "measurableImpactExpanded": "We believe in accountability and results. Before starting any project, we establish clear success metrics and key performance indicators. Our solutions are designed to deliver tangible benefits—whether that's increased efficiency, cost savings, revenue growth, or improved customer satisfaction. We track progress and provide regular reports to ensure you see the value of your technology investment.",
  "readyToWorkWithUs": "Ready to work with us?",
  "readyToWorkWithUsDescription": "Let's discuss how our team can help your business achieve its technology goals.",
  "company": "Company",
  "aboutUs": "About Us",
  "ourServices": "Our Services",
  "allRightsReserved": "All rights reserved",
  "jobOpenings": {
    "javaDeveloper": {
      "title": "Java Developer",
      "shortDescription": "Software Development and Engineering",
      "aboutRole": "We are looking for a Java developer with 6+ years of experience in the field. If you have a solid technical background, have a passion for software development, but are also curious about other technologies - then we have a very exciting opportunity for you.",
      "requirements": [
        "Thorough backend experience in Java (6+ years)",
        "Excellent knowledge of Spring/SpringBoot",
        "Integration projects in APIs",
        "TDD (Test-Driven Development)",
        "Understanding of cloud-based web applications infra and deployment (AWS, Docker, CI/CD, Kubernetes/EKS, Jenkins)",
        "Relational databases (preferably Oracle)",
        "Git",
        "Maven",
        "Scrum",
        "Interest in investigating, explaining, documenting, and teaching, as well as coding and quality assurance work",
        "Willingness to execute and own both big and small tasks",
        "Pragmatic mindset enough to enjoy improvement and automation"
      ],
      "candidatesShould": [
        "Be highly professional and solution-oriented with a focus on the client's business needs",
        "Be highly responsible and reliable",
        "Have great social skills",
        "Flexible to travel"
      ],
      "languageRequirements": [
        "English (Fluent)"
      ]
    },
    "dataEngineer": {
      "title": "Data Engineer",
      "shortDescription": "Software Development and Engineering",
      "aboutRole": "We are looking for a Data Engineer with 5+ years of experience in data engineering and analytics. If you have a passion for building scalable data solutions and working with modern data technologies, this is the perfect opportunity for you.",
      "requirements": [
        "5+ years of experience in data engineering",
        "Strong knowledge of Python, SQL, and data modeling",
        "Experience with cloud data platforms (AWS, Azure, or GCP)",
        "Knowledge of data pipeline tools (Apache Airflow, Luigi, or similar)",
        "Experience with big data technologies (Spark, Hadoop, Kafka)",
        "Understanding of data warehousing concepts",
        "Experience with version control (Git)",
        "Knowledge of containerization (Docker, Kubernetes)"
      ],
      "candidatesShould": [
        "Be detail-oriented and analytical",
        "Have strong problem-solving skills",
        "Be able to work independently and in teams",
        "Have excellent communication skills"
      ],
      "languageRequirements": [
        "English (Fluent)"
      ]
    },
    "fullstackDeveloper": {
      "title": "Fullstack Utvecklare",
      "shortDescription": "Software Development and Engineering",
      "aboutRole": "Vi söker en Fullstack Utvecklare med 4+ års erfarenhet av modern webbutveckling. Om du har en passion för att bygga användarvänliga applikationer och arbeta med både frontend och backend, så har vi en spännande möjlighet för dig.",
      "requirements": [
        "4+ års erfarenhet av fullstack utveckling",
        "Stark kunskap inom React, Node.js och TypeScript",
        "Erfarenhet av databaser (PostgreSQL, MongoDB)",
        "Kunskap om cloud-plattformar (AWS, Azure)",
        "Erfarenhet av Git och moderna utvecklingsworkflows",
        "Förståelse för RESTful APIs och GraphQL",
        "Erfarenhet av testning (Jest, Cypress)",
        "Kunskap om CI/CD pipelines"
      ],
      "candidatesShould": [
        "Vara kreativ och lösningsorienterad",
        "Ha starka kommunikationsfärdigheter",
        "Vara flexibel och anpassningsbar",
        "Ha en passion för att lära sig nya teknologier"
      ],
      "languageRequirements": [
        "Svenska (Flytande)",
        "Engelska (Flytande)"
      ]
    },
    "dotnetDeveloper": {
      "title": ".Net Utvecklare",
      "shortDescription": "Software Development and Engineering",
      "aboutRole": "Vi söker en .NET Utvecklare med 5+ års erfarenhet av .NET-utveckling. Om du har en stark teknisk bakgrund och passion för att bygga robusta applikationer, så har vi en utmärkt möjlighet för dig.",
      "requirements": [
        "5+ års erfarenhet av .NET utveckling",
        "Stark kunskap inom C#, ASP.NET Core och Entity Framework",
        "Erfarenhet av cloud-plattformar (Azure, AWS)",
        "Kunskap om microservices arkitektur",
        "Erfarenhet av SQL Server och databasdesign",
        "Kunskap om Git och Azure DevOps",
        "Erfarenhet av testning (xUnit, NUnit)",
        "Förståelse för CI/CD pipelines"
      ],
      "candidatesShould": [
        "Vara kvalitetsmedveten och detaljorienterad",
        "Ha starka analytiska färdigheter",
        "Vara en teamspelare med god kommunikation",
        "Ha en passion för kontinuerlig förbättring"
      ],
      "languageRequirements": [
        "Svenska (Flytande)",
        "Engelska (Flytande)"
      ]
    }
  }
}
