{
  "welcome": "Innovativa IT-lösningar för ditt företag",
  "description": "Vi levererar toppmoderna teknikkonsulttjänster och digital transformation för att stärka ditt företags konkurrenskraft och utvecklingspotential i den digitala eran",
  "getStarted": "Få en gratis konsultation",
  "learnMore": "Utforska våra tjänster",
  "services": "Våra tjänster",
  "whyChooseUs": "Varför välja Vexita",
  "contactUs": "Kontakta oss",
  "about": "Om oss",
  "home": "Hem",
  "careers": "Karriär",
  "contact": "Kontakt",
  "contactHero": "Tveka inte att höra av dig!",
  "contactHeroDescription": "Vi skulle älska att höra från dig! Fyll i formuläret så hör vi av oss inom kort.",
  "contactInformation": "Kontaktinformation",
  "officeAddress": "Kontorsadress",
  "postAddress": "Postadress",
  "phone": "Telefon",
  "email": "E-post",
  "businessHours": "Öppettider",
  "businessHoursText": "Måndag - Fredag: 09:00 - 18:00\nLördag - Söndag: Stängt",
  "findUs": "Hitta oss",
  "firstName": "Förnamn",
  "lastName": "Efternamn",
  "emailLabel": "E-post *",
  "howCanWeHelp": "Hur kan vi hjälpa? *",
  "sendMessage": "Skicka meddelande",
  "sending": "Skickar...",
  "servicesHero": "Våra tjänster",
  "servicesHeroDescription": "Omfattande tekniklösningar som kraftfullt utvecklar ditt företags potential",
  "digitalTransformation": "Digital transformation",
  "digitalTransformationDescription": "Vi hjälper företag att modernisera sin verksamhet genom strategiska digitala transformationsinitiativ. Vårt tillvägagångssätt fokuserar på att anpassa teknologi med dina affärsmål för att skapa hållbar tillväxt.",
  "digitalTransformationFeatures": [
    "Automatisering av affärsprocesser",
    "Modernisering av äldre system",
    "Digitala arbetsplatslösningar",
    "Datadrivet beslutsfattande"
  ],
  "cloudSolutions": "Molnlösningar",
  "cloudSolutionsDescription": "Våra molnexperter designar, implementerar och hanterar säkra molnmiljöer som skalar med ditt företag. Vi arbetar med ledande molnleverantörer för att leverera pålitliga och kostnadseffektiva lösningar.",
  "cloudSolutionsFeatures": [
    "Strategier för molnmigrering",
    "Multi-molnarkitektur",
    "Molnsäkerhet och efterlevnad",
    "Hanterade molntjänster"
  ],
  "softwareDevelopment": "Mjukvaruutveckling",
  "softwareDevelopmentDescription": "Vi bygger anpassade mjukvarulösningar som adresserar dina unika affärsutmaningar. Vårt utvecklingsteam följer branschens bästa praxis för att leverera högkvalitativ, underhållbar kod.",
  "softwareDevelopmentFeatures": [
    "Anpassad applikationsutveckling",
    "Webb- och mobilapplikationer",
    "API-utveckling och integration",
    "DevOps och CI/CD-implementering"
  ],
  "itSecurity": "IT-säkerhet",
  "itSecurityDescription": "Skydda ditt företag med våra omfattande cybersäkerhetslösningar. Vi hjälper till att identifiera sårbarheter, implementera säkerhetskontroller och utveckla incidenthanteringsplaner.",
  "itSecurityFeatures": [
    "Säkerhetsbedömningar och revisioner",
    "Endpoint-skydd",
    "Nätverkssäkerhet",
    "Säkerhetsmedvetenhet utbildning"
  ],
  "readyToGetStarted": "Redo att komma igång?",
  "readyToGetStartedDescription": "Kontakta oss idag för en gratis konsultation och upptäck hur våra IT-konsulttjänster kan hjälpa ditt företag att växa.",
  "expertTeam": "Expertteam",
  "expertTeamDescription": "Vårt team av certifierade IT-proffs bidrar med decennier av branschexpertis.",
  "provenResults": "Bevisade resultat",
  "provenResultsDescription": "Vi har hjälpt hundratals företag att uppnå sina teknologimål.",
  "dedicatedSupport": "Dedikerad support",
  "dedicatedSupportDescription": "24/7 support och underhåll för att hålla dina system igång smidigt.",
  "joinOurTeam": "Varmt välkommen i vårt team",
  "joinOurTeamDescription": "Bygg din karriär tillsammans med oss och bidra till att forma framtiden för teknikkonsulting",
  "currentOpenings": "Aktuella tjänster",
  "applyNow": "Ansök nu",
  "requirements": "Krav:",
  "whyWorkWithUs": "Varför jobba med oss?",
  "innovationFocus": "Innovationsfokus",
  "innovationFocusDescription": "Arbeta med banbrytande teknologier och innovativa lösningar som gör verklig skillnad.",
  "greatTeam": "Fantastiskt team",
  "greatTeamDescription": "Gå med i ett samarbetsinriktat team av begåvade proffs som stöttar varandras personliga och professionella utveckling.",
  "growthOpportunities": "Tillväxtmöjligheter",
  "growthOpportunitiesDescription": "Med kontinuerliga studie- och utvecklingsmöjligheter förstärker vi din kompetens och karriär.",
  "dontSeeRightPosition": "Hittar du inte rätt jobb/position?",
  "dontSeeRightPositionDescription": "Vi letar alltid efter begåvade individer. Skicka in din CV så kommer vi att ha dig i åtanke när framtida möjligheter uppstår.",
  "aboutHero": "Om Vexita AB",
  "aboutHeroDescription": "Din pålitlige partner för innovativa tekniklösningar",
  "ourStory": "Vår historia",
  "ourStoryParagraph1": "Grundat 2015 började Vexita AB med det enkla uppdraget: att hjälpa företag att nyttja informationsteknologi för att nå sina affärsmässiga mål. Det som började som ett litet team av passionerade IT-proffs har vuxit till ett fullservice konsultföretag med expertis inom hela teknikspektrumet.",
  "ourStoryParagraph2": "Under de gångna åren har vi hjälpt företag, inom olika branscher, att transformera deras teknikinfrastruktur och implementera innovativa lösningar. Dessa åtgärder har påtagligt ökat kundernas tillväxt och konkurrenskraft i en alltmer digital värld.",
  "ourStoryParagraph3": "Idag fortsätter vi att drivas av våra grundläggande principer: leverera exceptionellt värde, upprätthålla teknisk excellens och bygga varaktiga kundrelationer baserade på förtroende och resultat.",
  "founded": "Grundat",
  "projects": "Projekt",
  "years": "År",
  "ourValues": "Våra värderingar",
  "ourValuesDescription": "Principerna som driver allt vi gör och definierar vilka vi är som din teknikpartner.",
  "integrityFirst": "Integritet först",
  "integrityFirstDescription": "Ärliga råd. Transparent prissättning. Inga dolda agendor. Vi rekommenderar vad som är rätt för dig och ditt företag och inte vad som är lönsamt för oss.",
  "integrityFirstExpanded": "Förtroende är grunden för varje framgångsrikt teknikpartnerskap. Vi förtjänar det genom konsekvent ärlighet, tydlig kommunikation och att alltid sätta dina affärsintressen först. När vi säger att något kommer att fungera, så gör det. När vi identifierar risker berättar vi det direkt. Inga överraskningar, inga ursäkter—bara pålitlig expertis du kan lita på.",
  "futureReadyInnovation": "Framtidsklar innovation",
  "futureReadyInnovationDescription": "Vi följer inte bara trender—vi förutsäger dem. Banbrytande lösningar, som håller dig främst när morgondagens utmaningar kan skönjas.",
  "futureReadyInnovationExpanded": "Innovation handlar inte om att använda den senaste tekniken för dess egen skull. Det handlar om att identifiera framväxande möjligheter och bygga lösningar som ger dig en konkurrensfördel. Vårt team studerar och utforskar kontinuerligt nya teknologier, utvärderar deras affärspotential och implementerar endast de som levererar verkligt värde till din organisation.",
  "relentlessExcellence": "Obeveklig excellens",
  "relentlessExcellenceDescription": "Bra nog är inte bra nog. Vi är besatta av detaljer och levererar lösningar som överträffar förväntningarna varje gång.",
  "relentlessExcellenceExpanded": "Excellens är en vana, inte en slump. Varje kodrad, varje systemdesign, varje kundinteraktion speglar vårt engagemang för att nå högsta standard. Vi implementerar rigorösa kvalitetssäkringsprocesser, genomför grundlig testning och förfinar kontinuerligt våra metoder för att säkerställa exceptionella resultat, som står sig över tid.",
  "truePartnership": "Ett äkta partnerskap",
  "truePartnershipDescription": "Vi är inte bara leverantörer vi är dina teknikallierade. Dina framgångar, din tillväxt är vårt uppdrag.",
  "truePartnershipExpanded": "Verkligt partnerskap går bortom kontrakt och leveranser. Vi investerar tid i att förstå dina affärsmål, branschutmaningar och tillväxtambitioner. Vår framgång mäts av din framgång, vilket innebär att vi är motiverade att hitta lösningar som ger långsiktigt värde, inte bara snabba fixar. Vi blir en förlängning av ditt team, delar kunskap och firar framgångar tillsammans.",
  "lightningAgility": "Blixtsnabb smidighet",
  "lightningAgilityDescription": "Marknader rör sig snabbt. Vi rör oss snabbare. Snabb implementering, snabba förändringar och lösningar som anpassar sig och följer ditt företags utveckling",
  "lightningAgilityExpanded": "I dagens affärsmiljö är hastighet en konkurrensfördel. Våra agila metoder och flexibla teamstruktur gör att vi kan reagera snabbt på förändrade krav, marknadsförhållanden och nya möjligheter. Vi bygger skalbara lösningar som kan utvecklas med ditt företag och säkerställer att din teknikinfrastruktur stöder tillväxt snarare än begränsar den.",
  "measurableImpact": "Mätbar påverkan",
  "measurableImpactDescription": "Teknologi för teknikens egen skull är meningslös. Varje lösning vi levererar ger verkligt mätbara affärsresultat.",
  "measurableImpactExpanded": "Vi tror på ansvarstagande och resultat. Innan vi startar ett projekt fastställer vi tydliga mål för mätning av framgång och indikatorer för nyckelprestanda. Våra lösningar är designade för att leverera påtagliga fördelar—oavsett om det är ökad effektivitet, kostnadsbesparingar, intäktstillväxt eller förbättrad kundtillfredsställelse. Vi kartlägger gjorda framsteg och tillhandahåller regelbundna rapporter för att säkerställa att du ser värdet av din teknikinvestering.",
  "readyToWorkWithUs": "Redo att arbeta med oss?",
  "readyToWorkWithUsDescription": "Låt oss diskutera hur vårt team kan hjälpa ditt företag att uppnå sina teknikmål.",
  "company": "Företag",
  "aboutUs": "Om oss",
  "ourServices": "Våra tjänster",
  "allRightsReserved": "Alla rättigheter förbehållna"
}
